<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"dd2e1f5b8ae51b3ea53d5f9845d28c29621b804b3ace8429e0cb1f50849880aa","plan_job_ref":"Job Terraform Plan #559 at https://github.com/cal-itp/data-infra/actions/runs/18145169201","plan_out_hash":"171d0e34fac8461137c7d95fef43065fec046eb3e9d5e2169b7a57318793f130","plan_hash":"003b15f6f71928f8f70367b6232f07896ce75c396df7212179db13b6ea40906b","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/networks/us__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_compute_address.enghouse-sftp-address will be created
+   resource "google_compute_address" "enghouse-sftp-address" {
+       address            = (known after apply)
+       address_type       = "EXTERNAL"
+       creation_timestamp = (known after apply)
+       effective_labels   = {
+           "goog-terraform-provisioned" = "true"
        }
+       id                 = (known after apply)
+       label_fingerprint  = (known after apply)
+       name               = "enghouse-sftp-address"
+       network_tier       = (known after apply)
+       prefix_length      = (known after apply)
+       project            = "cal-itp-data-infra"
+       purpose            = (known after apply)
+       region             = "us-west2"
+       self_link          = (known after apply)
+       subnetwork         = (known after apply)
+       terraform_labels   = {
+           "goog-terraform-provisioned" = "true"
        }
+       users              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   google_compute_address_enghouse-sftp-address_ip        = (known after apply)
```
</details>

:memo: Plan generated in [Terraform Plan #559](https://github.com/cal-itp/data-infra/actions/runs/18145169201)